In [5]:
import numpy as np
import pandas as pd

In [6]:
dict1 = {
    "name" :['harry' , 'rohan' , 'piyush'],
    "marks":[92,34,24],
    "city" :["Nahik", "rampur", "Mumbai"]
}

In [7]:
df = pd.DataFrame(dict1)

In [8]:
df

     name  marks    city
0   harry     92   Nahik
1   rohan     34  rampur
2  piyush     24  Mumbai

In [9]:
df.to_csv("freinds.csv")

In [ ]:
df.to_csv("freinds.csv")